## 955148791056: ConfigRules
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_config_config_rule.cbs_elb_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_elb_logging_enabled" {
      + arn         = (known after apply)
      + description = "A Config rule that checks whether ELB logging is enabled."
      + id          = (known after apply)
      + name        = "cbs_elb_logging_enabled"
      + rule_id     = (known after apply)
      + tags_all    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancing::LoadBalancer",
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ELB_LOGGING_ENABLED"
        }
    }

  # aws_config_config_rule.cbs_vpc_flow_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_vpc_flow_logging_enabled" {
      + arn         = (known after apply)
      + description = "A Config rule that checks whether VPC flow logs are enabled."
      + id          = (known after apply)
      + name        = "cbs_vpc_flow_logging_enabled"
      + rule_id     = (known after apply)
      + tags_all    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::VPC",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "VPC_FLOW_LOGS_ENABLED"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_elb_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_bucket_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_satellite_bucket_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_vpc_flow_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_wafv2_logs_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aws_config_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.security_config"]

15 tests, 8 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
